lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
/*
 * Copyright (c) 2026 Oray Inc. All rights reserved.
 * Copyright (C) 2022-2026 OraySZ / OrayOS-Team.
 *
 * This work is licensed under CC BY-NC-SA 4.0.
 * To view a copy of this license, visit:
 * https://creativecommons.org/licenses/by-nc-sa/4.0/
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *
 * File:     ch32-eth-dwmac.c
 * Author:   lintel <lintel.huang@gmail.com>
 * Date:     2026-04-27
 *
 * Description:
 *     CH32 以太网（STMAC+DMA）+ tap/user 后端。
 *
 *     CH32V307/CH32V317 ST-MAC以太网(DWMAC)兼容后端。
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "qemu/module.h"
#include "qom/object.h"
#include "hw/sysbus.h"
#include "hw/qdev-core.h"
#include "hw/qdev-properties.h"
#include "hw/qdev-properties-system.h"
#include "hw/irq.h"
#include "net/net.h"
#include "qemu/main-loop.h"
#include "qemu/timer.h"
#include "qemu/bswap.h"
#include "hw/boards.h"
#include "system/address-spaces.h"
#include "target/riscv/cpu.h"
#include "target/riscv/cpu_bits.h"
#include "net/checksum.h"
#include "net/eth.h"
#include "ch32-machine-internal.h"

/* 防止宿主机网包在未配置/未就绪 DMA 时写入任意物理地址，破坏 FreeRTOS 队列等元数据 */
static bool ch32_eth_span_in_main_sram(hwaddr p, hwaddr len)
{
    MachineState *ms;
    ram_addr_t rsz;
    hwaddr off;

    if (len == 0) {
        return false;
    }
    ms = current_machine;
    if (!ms || !ms->ram) {
        return false;
    }
    rsz = memory_region_size(ms->ram);
    if (p < CH32_SRAM_BASE) {
        return false;
    }
    off = p - CH32_SRAM_BASE;
    if (off > rsz || len > rsz - off) {
        return false;
    }
    return true;
}

static bool ch32_eth_ptr_in_main_sram(hwaddr p)
{
    return ch32_eth_span_in_main_sram(p, 1);
}

#define CH32_ETH_OFF_MACMIIAR  0x010u
#define CH32_ETH_OFF_MACMIIDR  0x014u
/*
 * CH32V30x 在 ch32v30x.h 中为单一扁平 ETH_TypeDef（MAC + 大段 RESERVED + PTP + DMA）。
 * DMA 寄存器从 DMABMR 起算 offsetof = 0x1000（非 STM32F4 的 ETH_MAC 与 ETH_DMA 分块 +0x1000
 * 另一套布局）。偏移必须与固件一致，否则 DMATDLAR/DMARDLAR 写在 0x1010/0x100c 而模型仍
 * 用旧 0x1008/0x1004 槽位，读回错误指针会在 fast_copy_to_dma 等处触发 Load fault。
 */
#define CH32_ETH_OFF_DMABMR    0x1000u
#define CH32_ETH_OFF_DMATPDR   0x1004u
#define CH32_ETH_OFF_DMARPDR   0x1008u
#define CH32_ETH_OFF_DMARDLAR  0x100cu
#define CH32_ETH_OFF_DMATDLAR  0x1010u
#define CH32_ETH_OFF_DMASR     0x1014u
#define CH32_ETH_OFF_DMAOMR    0x1018u
#define CH32_ETH_OFF_DMAIER    0x101cu

#define CH32_ETH_MACMIIAR_MB   0x00000001u
#define CH32_ETH_MACMIIAR_MW   0x00000002u
#define CH32_ETH_DMABMR_SR     0x00000001u
#define CH32_ETH_DMAOMR_ST     0x00002000u
#define CH32_ETH_DMAOMR_SR     0x00000002u
#define CH32_ETH_DMAOMR_FTF    0x00100000u

#define CH32_ETH_DMASR_TPS_M   0x00700000u
#define CH32_ETH_DMASR_RPS_M   0x000E0000u
#define CH32_ETH_DMASR_TPS_FETCH 0x00100000u
#define CH32_ETH_DMASR_RPS_WAIT  0x00060000u

/*
 * DMASR 异常位（STM32 以太网 DMA 兼容）：
 *   TBUS (bit 5): Transmit Buffer Unavailable
 *   RBUS (bit 7): Receive Buffer Unavailable
 */
#define CH32_ETH_DMASR_TBUS  0x00000020u
#define CH32_ETH_DMASR_RBUS  0x00000080u

/*
 * DMASR 写 1 清除：覆盖 ch32v30x_eth.h 中常用 IT/异常位及 CH32 内部 PHY 链路位
 *（ETH_DMA_IT_PHYLINK 等），避免固件清标志后读回仍为 1。
 */
#define CH32_ETH_DMASR_W1C_MASK 0x807fffffu

#define CH32_ETH_DMARX_OWN     0x80000000u
#define CH32_ETH_DMARX_FS      0x00000200u
#define CH32_ETH_DMARX_LS      0x00000100u
#define CH32_ETH_DMARX_FT      0x00000020u
#define CH32_ETH_DMARX_FL      0x3fff0000u

#define CH32_ETH_DMATX_OWN     0x80000000u
#define CH32_ETH_DMATX_FS      0x10000000u
#define CH32_ETH_DMATX_LS      0x20000000u

#define CH32_ETH_DMA_IT_R      0x00000040u
#define CH32_ETH_DMA_IT_T      0x00000001u
#define CH32_ETH_DMA_IT_NIS    0x00010000u
#define CH32_ETH_DMA_IT_AIS    0x00008000u

/*
 * DMASR Normal 中断源位（R, T, PHYLINK 等）：NIS = 这些位的 OR。
 * DMASR Abnormal 中断源位（RBUS, TBUS, ER 等）：AIS = 这些位的 OR。
 * NIS/AIS 是只读汇总位，由硬件自动计算。
 *
 * PHYLINK（bit31）也属于 Normal 中断源：
 * EVT eth_driver_10M.c 在 WCHNET_ETHIsr 中先判断 NIS，再判断 PHYLINK。
 * 如果 NIS 不被自动设置，固件将跳过 PHYLINK 分支，导致 PHY link-up 失败。
 */
/* ETH_DMA_IT_PHYLINK = DMASR bit31，EVT 10M 驱动通过此中断触发 ETH_PHYLink() */
#define CH32_ETH_DMA_IT_PHYLINK  0x80000000u
#define CH32_ETH_DMASR_NIS_SRC (CH32_ETH_DMA_IT_R | CH32_ETH_DMA_IT_T | CH32_ETH_DMA_IT_PHYLINK)
#define CH32_ETH_DMASR_AIS_SRC (CH32_ETH_DMASR_RBUS | CH32_ETH_DMASR_TBUS)

/*
 * MACCR 寄存器（偏移 0x0000）
 *   IPC (bit 10): 实现校验和存入控制，开启接收 IP/负载校验和验证
 */
#define CH32_ETH_OFF_MACCR     0x0000u
#define CH32_ETH_MACCR_IPC     0x00000400u

/*
 * MACCR 扩展位（CH32FV2x_V3xRM §27 + STM32 DWMAC 同源布局）：
 *   PS  (bit 15): Port Select，0 = GMII/RGMII（1000M）；1 = MII/RMII（10/100M）
 *   FES (bit 14): Fast Ethernet Speed，0 = 10M；1 = 100M（仅 PS=1 有效）
 *   DM  (bit 11): Duplex Mode，0 = 半双工；1 = 全双工
 *
 * CH32V307/V317 真机支持 MII/RMII/RGMII（10/100/1000 Mbps）。
 * QEMU hw/net 层按字节流透传，这些位仅用于寄存器回读 / PHY PHYSR 回映 /
 * 日志；真机需驱动按 PHY 协商结果主动写 MACCR.PS/FES/DM 以匹配链路。
 */
#define CH32_ETH_MACCR_PS      (1u << 15)
#define CH32_ETH_MACCR_FES     (1u << 14)
#define CH32_ETH_MACCR_DM      (1u << 11)

/*
 * TDes0 的 CIC 字段 [23:22]：校验和插入控制
 *   00: 禁用 COE
 *   01: 仅 IPv4 头部校验和
 *   10: IPv4 头部 + TCP/UDP 负载（仅 segment）
 *   11: 全部（IPv4 头部 + TCP/UDP/ICMP + pseudo-header）
 */
#define CH32_ETH_DMATX_CIC_M   0x00C00000u
#define CH32_ETH_DMATX_CIC_OFF 0x00000000u
#define CH32_ETH_DMATX_CIC_IP  0x00400000u
#define CH32_ETH_DMATX_CIC_SEG 0x00800000u
#define CH32_ETH_DMATX_CIC_ALL 0x00C00000u

/*
 * RDes0 校验和错误位（MACCR.IPC=1 时硬件验证结果）
 *   IPHCE (bit 7): IPv4 头部校验和错误
 *   PCE   (bit 0): 负载校验和错误（TCP/UDP/ICMP）
 */
#define CH32_ETH_DMARX_IPHCE   0x00000080u
#define CH32_ETH_DMARX_PCE     0x00000001u

#define CH32_ETH_MAX_RING      16
#define CH32_ETH_PKT_MAX       2048

/*
 * PHY 变体枚举：
 *   CH182    - CH32V317 外置 100M CH182 PHY
 *   PHY10M   - CH32V307 内置 10M PHY
 *   RTL8211F - Realtek 1000M RGMII PHY（用于 V307/V317 RGMII 路径）
 *
 * 通过属性 phy-model="ch182|phy10m|rtl8211f" 选择，未填时默认 CH182。
 */
typedef enum {
    CH32_ETH_PHY_CH182 = 0,
    CH32_ETH_PHY_PHY10M,
    CH32_ETH_PHY_RTL8211F,
} Ch32EthPhyVariant;

typedef struct Ch32EthState {
    SysBusDevice parent_obj;
    MemoryRegion mmio;
    NICState *nic;
    NICConf conf;
    QEMUBH *bh;
    QEMUTimer poll;
    bool poll_active;
    /*
     * 退避计数器：BH 发现无实际工作（TX/RX 均无活动）时递增，
     * 达到阈值后将 poll 间隔从 10ms 延长至 100ms，降低空闲 CPU 占用。
     * 有实际工作时清零，恢复 10ms 快速轮询。
     */
    unsigned poll_idle_count;

    uint32_t mmio_w[CH32_ETH_MMIO_SIZE / 4];
    uint16_t phy_reg[32];
    uint16_t phy_bcr;
    uint16_t phy_bsr;
    uint8_t rx_stash[CH32_ETH_PKT_MAX];
    uint32_t rx_stash_len;

