lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
    /*
     * DMA chain 游标：跟踪 chain 链表中当前描述符地址，避免每次都从
     * DMATDLAR/DMARDLAR 头部线性扫描。复位时清零，触发重新初始化。
     */
    hwaddr tx_cur_desc;     /* 当前 TX 描述符 hwaddr */
    hwaddr rx_cur_desc;     /* 当前 RX 描述符 hwaddr */

    /*
     * 反向指针：连接 ETH 外设中断到 PFIC（通过 ch32_eth_meip_resync）。
     * 由 ch32-v.c 在 machine init 中设置；若为 NULL 则不触发中断。
     */
    Ch32MachineState *machine;

    /*
     * 中断激活状态标志：模拟真实 PFIC 的"中断处理中不重入"行为。
     * 当 ETH 中断被注入（MEIP=1）时置 true；在 DMASR W1C 清标志使
     * DMASR 不再活跃时置 false（表示 Guest 已应答中断）。
     * 若为 true，resync 不重复注入 MEIP，防止中断风暴。
     */
    bool irq_active;

    /*
     * PHY link-up 延迟：为了使固件的 ETH_Configuration() 在初始化时读到
     * link-down 状态（LastPhyStat != 0x782d），而后续循环读到 link-up，
     * 从而触发 ETH_PHYLink() 建立连接。
     * phy_link_up_deadline_ns：QEMU 虚拟时钟 ns，达到后 BSR 返回 link-up。
     */
    uint64_t phy_link_up_deadline_ns;

    /*
     * phy_link_irq_injected：防止重复注入 PHYLINK 中断。
     * 10M 驱动（eth_driver_10M.c）依赖 ETH_DMA_IT_PHYLINK（DMASR bit31）中断
     * 触发 ETH_PHYLink()，而不是轮询 BSR。
     * 当 phy_link_up_deadline_ns 到期后，QEMU 主动向 DMASR 设置 PHYLINK 位
     * 并注入中断，使固件走 ISR 路径完成 PHY link-up 配置。
     * 此标志确保每次 reset 后只注入一次，避免重复触发。
     */
    bool phy_link_irq_injected;

    /*
     * phy_model：字符串属性（DEFINE_PROP_STRING），取值 "ch182|phy10m|rtl8211f"；
     * NULL 时默认 CH182。未知字符串使 realize 失败。
     * phy_variant 为解析后的枚举值，运行期唯一依据。
     */
    char *phy_model;
    Ch32EthPhyVariant phy_variant;

    /*
     * RTL8211F 扩展寄存器状态：
     *   rtl8211f_page      - Page Select (reg 0x1F)，复位 0x0000（基础页），
     *                         写入 0xd04 进入 LED/EEE 扩展页，其他值透传。
     *   rtl8211f_mmd_ctrl  - MACR (reg 0x0D) MMD 控制寄存器，记录 DEVAD+Function。
     *   rtl8211f_mmd_addr  - MAADR (reg 0x0E) MMD 地址/数据寄存器写入值（简化：
     *                         对未定义 MMD 寄存器读返回 0，不实际维护 MMD 空间）。
     */
    uint16_t rtl8211f_page;
    uint16_t rtl8211f_mmd_ctrl;
    uint16_t rtl8211f_mmd_addr;
} Ch32EthState;

OBJECT_DECLARE_SIMPLE_TYPE(Ch32EthState, CH32_ETH_DWMAC)

/*
 * ch32_eth_is_phy10m_path - 当前 PHY 变体是否走 CH32V307 内置 10M PHY 路径。
 * 所有原 10M 分支判定统一基于 phy_variant。
 */
static inline bool ch32_eth_is_phy10m_path(const Ch32EthState *s)
{
    return s->phy_variant == CH32_ETH_PHY_PHY10M;
}

/*
 * ch32_eth_is_rtl8211f_path - 当前 PHY 变体是否为 Realtek RTL8211F 千兆 RGMII PHY。
 * CH32V307/CH32V317 通过 RGMII 外接 RTL8211F 时使用该路径；PHY Clause22 寄存器
 * 与 CH182 完全不同（PHY ID、PHYSR、Page Select 0x1F、MMD 间接访问等）。
 */
static inline bool ch32_eth_is_rtl8211f_path(const Ch32EthState *s)
{
    return s->phy_variant == CH32_ETH_PHY_RTL8211F;
}

/*
 * ch32_eth_phy_bcr_reset - PHY BCR 上电/软复位默认值：
 *   PHY10M   : 0x1000 (AN=1, 10M HD)
 *   RTL8211F : 0x1140 (AN=1, 1000M FD)
 *   CH182    : 0x3100 (AN=1, 100M FD)
 */
static uint16_t ch32_eth_phy_bcr_reset(const Ch32EthState *s)
{
    switch (s->phy_variant) {
    case CH32_ETH_PHY_PHY10M:
        return 0x1000u;
    case CH32_ETH_PHY_RTL8211F:
        return 0x1140u;
    case CH32_ETH_PHY_CH182:
    default:
        return 0x3100u;
    }
}

/*
 * ch32_eth_meip_resync - 同步 ETH DMA 中断到 PFIC/MEIP。
 *
 * ETH_IRQn = 77（word=2, bit=13）。固件 ETH_IRQHandler 通过
 * wch_evt_mcause_override=77 由 VTF/MEIP 机制路由。
 * 调用点：
 *   - DMA 状态寄存器（DMASR）发生变化后（收/发完成、DMASR W1C 清标志）
 *   - PFIC IENR/IRER 写后（通过 ch32_pfic_resync_all → ch32_eth_meip_resync）
 *
 * 中断风暴防护（模拟 PFIC "中断激活时不重入" 语义）：
 * 真实 CH32 PFIC 在中断被应答（handler 执行中）时不会再次投递同一中断，
 * 直到 handler 返回（mret）。QEMU 的 MEIP 模拟缺少此机制：
 * 若 DMASR 标志在 Guest mret 前又被置位，resync 会重新注入 MEIP，
 * 导致 Guest mret 后立即再次进入 IRQ handler 形成死循环。
 *
 * 解决：用 s->irq_active 标志跟踪中断激活状态：
 *   - 注入 MEIP 时 irq_active=true
 *   - Guest 在 IRQ handler 中 W1C 清 DMASR 使 dmasr_active=false 时 irq_active=false
 *   - irq_active=true 时 resync 不注入 MEIP
 *   - Guest mret 后若 DMASR 仍有事件，poll timer/BH 会在下次调用时注入
 */
void ch32_eth_meip_resync(Ch32MachineState *m)
{
    Ch32EthState *s;
    RISCVCPU *cpu;
    CPURISCVState *env;
    const unsigned n   = CH32_ETH_IRQ_N;    /* 77 */
    const unsigned wd  = n / 32u;            /* 2  */
    const unsigned bit = n % 32u;            /* 13 */
    bool ienr_on;
    bool dmasr_active;
    uint32_t ier, sr;

    if (!m) {
        return;
    }
    /* 找到 ETH 外设状态（通过 machine 结构中记录的反向指针） */
    s = m->eth_state;
    if (!s) {
        return;
    }
    cpu = &m->cpus.harts[0];
    env = &cpu->env;
    ienr_on = (m->pfic_ienr[wd] >> bit) & 1u;
    ier = s->mmio_w[CH32_ETH_OFF_DMAIER / 4];
    sr  = s->mmio_w[CH32_ETH_OFF_DMASR  / 4];
    dmasr_active = (ier & sr) != 0u;

    BQL_LOCK_GUARD();
    if (!ienr_on || !dmasr_active) {
        if (env->wch_evt_mcause_override == n) {
            riscv_cpu_update_mip(env, MIP_MEIP, 0);
            env->wch_evt_mcause_override = 0;
            env->mie &= ~MIP_MEIP;
            /* 清除 PFIC IACTR 中 ETH IRQ(77) 的激活状态 */
            ch32_pfic_irq_active_clear(m, n);
            /*
             * ETH MEIP 撤销：通知其他外设重新评估其中断请求
             * （与 ch32-eth-10m.c 的 MEIP 撤销路径一致）。
             */
            ch32_pfic_resync_pending_meip(m);
        }
        /* DMASR 不再活跃 → 清除激活标志 */
        s->irq_active = false;
        riscv_cpu_interrupt(env);
        return;
    }
    /*
     * 中断风暴防护：如果 irq_active=true，说明 ETH 中断正在处理中，
     * 不重复注入 MEIP。Guest 在 IRQ handler 中 W1C 清 DMASR 后
     * irq_active 会被清除；之后若有新事件（poll timer/BH 设 DMASR），
     * resync 会重新注入 MEIP。
     */
    if (s->irq_active) {
        return;
    }
    /*
     * MEIP 仲裁：如果其他外设已持有 MEIP，则不覆盖。
     * 等对方 IRQ 处理完后，对方会调用 ch32_pfic_resync_pending_meip
     * 重新触发我们的注入（与 ch32-eth-10m.c 的仲裁路径一致）。
     */
    if (env->wch_evt_mcause_override != 0u && env->wch_evt_mcause_override != n) {
        return;
    }
    env->mie |= MIP_MEIP;
    env->wch_evt_mcause_override = n;
    s->irq_active = true;
    /* 在 PFIC IACTR 中标记 ETH IRQ(77) 为激活状态 */
    ch32_pfic_irq_active_set(m, n);
    riscv_cpu_update_mip(env, MIP_MEIP, MIP_MEIP);
    riscv_cpu_interrupt(env);
}

static void ch32_eth_update_irq(Ch32EthState *s)
{
    ch32_eth_meip_resync(s->machine);
}

/*
 * ch32_eth_dmasr_raise - 设置 DMASR 位并同步中断。
 *
 * 注意：不手动设置 NIS/AIS 汇总位——它们在 ch32_eth_dmasr_read 中
 * 从底层事件位动态计算。这确保固件 W1C 清 NIS 后，如果底层事件
 * 位（R/T 等）仍在，NIS 会在下次读取时自动恢复，不会导致
 * dmasr_active 误判为 false。
 *
 * 中断风暴防护：
 * 调用者（BH/poll timer/MMIO write）每次都可能设置 DMASR 标志。
 * 如果 Guest 正在处理 ETH 中断（MEIP 已置位，irq_active=true），
 * ch32_eth_meip_resync 会跳过重复注入 MEIP，防止 mret 后立即重入
 * IRQ handler 形成死循环。
 *
 * 每次 dmasr_raise 都调用 update_irq（进而 meip_resync），
 * 由 meip_resync 内部的 irq_active 检查来防护中断风暴——
 * 而不是在 dmasr_raise 中跳过 update_irq 调用。
 * 这样确保：当 irq_active 从 false 变为 true 时（Guest 首次进入
 * IRQ handler），后续的 dmasr_raise 不会重复注入；而当
 * irq_active 恢复为 false（Guest 清完 DMASR 标志）后，如果有
 * 新事件，update_irq 会正确注入 MEIP。
 */
static void ch32_eth_dmasr_raise(Ch32EthState *s, uint32_t bits)
{
    /* 只设底层事件位，不设 NIS/AIS 汇总位（它们在 dmasr_read 中动态计算） */
    s->mmio_w[CH32_ETH_OFF_DMASR / 4] |= (bits & ~(CH32_ETH_DMA_IT_NIS | CH32_ETH_DMA_IT_AIS));
    ch32_eth_update_irq(s);
}

