lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
/*
 * RTL8211F Clause22 + Page 0xd04 + MMD 间接访问模型。
 *
 * 基础页（rtl8211f_page==0x0000）寄存器：
 *   0x00 BMCR、 0x01 BMSR、 0x02/0x03 PHYID1/2（0x001CC916）、
 *   0x04 ANAR、  0x05 ANLPAR、 0x06 ANER、
 *   0x09 GBCR、  0x0A GBSR、   0x0F GBESR、
 *   0x0D MACR、  0x0E MAADR（MMD 间接）、
 *   0x11 PHYSR (RTL8211F 专属 speed/duplex/link)、
 *   0x1A INSR、  0x1F PAGSR。
 *
 * 扩展页 0xd04：0x10 LCR、 0x11 EEELCR，返回 guest 写入值。
 *
 * 链路模型：phy_link_up_deadline_ns 到期前返回 link-down，到期后返回
 * 1000M FD link-up（PHYSR=0x002C，GBSR 宣告链路伙伴 1000FD）。
 */
static uint16_t ch32_eth_phy_read_rtl8211f(Ch32EthState *s, unsigned reg)
{
    bool link_up = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) >= s->phy_link_up_deadline_ns;

    if (s->rtl8211f_page == 0x0d04u && (reg == 0x10u || reg == 0x11u)) {
        /* Page 0xd04 LCR/EEELCR：返回 guest 写入值（phy_reg[] 当缓存） */
        return s->phy_reg[reg];
    }

    switch (reg) {
    case 0x00:
        return s->phy_bcr;
    case 0x01:
        /* BMSR：link-up 后返回 bit2(Link)+bit5(AN Complete) */
        return link_up ? (uint16_t)(s->phy_bsr | 0x0024u) : s->phy_bsr;
    case 0x02:
        /* PHYID1 = OUI[21:6] = 0x001C (Realtek) */
        return 0x001cu;
    case 0x03:
        /* PHYID2 = OUI[5:0]<<10 | Model<<4 | Rev = 0xC916 (RTL8211F) */
        return 0xc916u;
    case 0x04:
        /* ANAR：宣告 100FD/100HD/10FD/10HD + 802.3 selector */
        return s->phy_reg[4] ? s->phy_reg[4] : 0x01e1u;
    case 0x05:
        /* ANLPAR：link-up 后返回链路伙伴能力，否则 0 */
        return link_up ? 0x45e1u : 0x0000u;
    case 0x06:
        /* ANER：LP AN Able + Page Received + Next Page Able */
        return 0x0007u;
    case 0x09:
        /* GBCR：宣告 1000FD（bit9） */
        return s->phy_reg[9] ? s->phy_reg[9] : 0x0200u;
    case 0x0a:
        /*
         * GBSR：link-up 后宣告链路伙伴 1000FD Capable（bit11）+
         * Local/Remote Receiver Status OK（bit13/bit12）+ Master Resolution（bit14）。
         */
        return link_up ? 0x7c00u : 0x0000u;
    case 0x0d:
        return s->rtl8211f_mmd_ctrl;
    case 0x0e:
        /* 简化：不实际维护 MMD 空间，所有未定义 MMD 寄存器读为 0 */
        return 0x0000u;
    case 0x0f:
        /* GBESR：1000T FD Capable (bit13) + 1000T HD Capable (bit12) */
        return 0x3000u;
    case 0x11:
        /*
         * PHYSR (RTL8211F 专属)：
         *   bits[5:4] Speed: 00=10M, 01=100M, 10=1000M, 11=reserved
         *   bit3      Duplex: 1=FD
         *   bit2      Link:   1=up
         * link-up 后返回 1000M FD link-up = 0b0000_0000_0010_1100 = 0x002C。
         */
        return link_up ? 0x002cu : 0x0000u;
    case 0x1a:
        return s->phy_reg[0x1a];
    case 0x1f:
        return s->rtl8211f_page;
    default:
        return (reg < 32) ? s->phy_reg[reg] : 0u;
    }
}

static void ch32_eth_phy_write_rtl8211f(Ch32EthState *s, unsigned reg, uint16_t v)
{
    if (reg < 32) {
        s->phy_reg[reg] = v;
    }
    /* Page 0xd04 LCR/EEELCR：仅存储 guest 写入值（上面 phy_reg[] 已存） */
    if (s->rtl8211f_page == 0x0d04u && (reg == 0x10u || reg == 0x11u)) {
        return;
    }
    switch (reg) {
    case 0x00:
        s->phy_bcr = v;
        if (v & 0x8000u) {
            /* 软复位：BMCR 恢复 0x1140，link-up 延迟 300ms，页选择清零 */
            s->phy_bcr = 0x1140u;
            s->phy_link_up_deadline_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL)
                                         + 300 * 1000000ULL;
            s->phy_link_irq_injected = false;
            s->rtl8211f_page = 0x0000u;
        }
        return;
    case 0x0d:
        s->rtl8211f_mmd_ctrl = v;
        return;
    case 0x0e:
        s->rtl8211f_mmd_addr = v;
        return;
    case 0x1f:
        s->rtl8211f_page = v;
        return;
    default:
        return;
    }
}

static void ch32_eth_phy_write(Ch32EthState *s, unsigned reg, uint16_t v)
{
    if (ch32_eth_is_rtl8211f_path(s)) {
        ch32_eth_phy_write_rtl8211f(s, reg, v);
        return;
    }
    if (reg < 32) {
        s->phy_reg[reg] = v;
    }
    if (reg == 0) {
        s->phy_bcr = v;
        if (v & 0x8000u) {
            /*
             * 软件复位：恢复 PHY 上电默认值（速率能力由 phy_variant 决定）。
             *   10M（CH32V307 内置）：BCR=0x1000（AN=1, 10M half-duplex）
             *   100M（CH32V317 CH182）：BCR=0x3100（AN=1, 100M=1, FD=1）
             * 同时重置 link-up 延迟，模拟 PHY 重新连接过程。
             * 对于 10M 模式，重置 phy_link_irq_injected，使下次 deadline
             * 到期时再次注入 PHYLINK 中断。
             */
            s->phy_bcr = ch32_eth_phy_bcr_reset(s);
            s->phy_link_up_deadline_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 300 * 1000000ULL;
            s->phy_link_irq_injected = false;
        }
    }
    /* PHY write debug removed */
}

static uint16_t ch32_eth_phy_read(Ch32EthState *s, unsigned reg)
{
    uint16_t val;

    if (ch32_eth_is_rtl8211f_path(s)) {
        return ch32_eth_phy_read_rtl8211f(s, reg);
    }
    switch (reg) {
    case 0:
        val = s->phy_bcr;
        break;
    case 1:
        /*
         * IEEE BSR：Link(2)、Autoneg Complete(5) 等（bit2+bit5 = 0x0024）。
         * PHY link-up 延迟：在 phy_link_up_deadline_ns 之前返回 link-down
         * （0x7809），之后返回 link-up（0x782d）。
         * 这样 ETH_Configuration() 初始化时读到 link-down，
         * 当 WCHNET_QueryPhySta() 循环读到 link-up 时触发 ETH_PHYLink()。
         * 10M 和 100M 的 BSR 位定义相同，无需区分。
         */
        if (qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) < s->phy_link_up_deadline_ns) {
            val = s->phy_bsr;  /* link-down: 0x7809 */
        } else {
            val = (uint16_t)(s->phy_bsr | 0x0024u);  /* link-up + AutoNego Complete: 0x782d */
        }
        break;
    case 2:
        /*
         * PHY ID1（OUI 高位）：
         *   100M CH182（CH32V317）：0x7371（与真机 OrayOS 日志一致）
         *   10M 内置（CH32V307）：0x0000（CH32V307 片内 10M PHY 无独立 OUI）
         */
        val = ch32_eth_is_phy10m_path(s) ? 0x0000u : 0x7371u;
        break;
    case 3:
        /* PHY ID2：同上，10M 返回 0x0000 */
        val = ch32_eth_is_phy10m_path(s) ? 0x0000u : 0x9011u;
        break;
    case 5:
        /*
         * ANLPAR（远端自动协商能力寄存器）：
         *   100M CH182：宣告 100TX/100TX-FD（0x05e1），供 phy_ch182_get_status 解析。
         *   10M 内置：返回 0x0000（无远端能力宣告）。
         *   eth_driver_10M.c 检查 (phy_anlpar & PHY_ANLPAR_SELECTOR_FIELD)：
         *   结果为假时走 phy_bmsr 路径，AutoNego Complete 后调用 ETH_LinkUpCfg()，
         *   并强制 MACCR &= ~ETH_Mode_FullDuplex（半双工，10M 标准行为）。
         */
        val = ch32_eth_is_phy10m_path(s) ? 0x0000u : (s->phy_reg[5] ? s->phy_reg[5] : 0x05e1u);
        break;
    case 0x19:
        /*
         * WCHNET_AccelerateLink step2（仅 100M CH182 驱动调用）：
         * 写 PHY_PAG_SEL(0x1F)=99，读 reg 0x19，要求 (val & 0xf) == 2。
         * 10M 驱动不调用此路径，返回存储值即可。
         */
        val = (!ch32_eth_is_phy10m_path(s) && s->phy_reg[0x1f] == 99u) ? 0x0002u : s->phy_reg[reg];
        break;
    case 0x10:
        /*
         * WCHNET_CheckLinkVaild（仅 100M CH182 驱动调用）：
         * 要求 (phy_stat & (1<<9)) != 0 以确认 link 有效。
         * 10M 驱动不调用此路径，返回存储值即可。
         */
        val = ch32_eth_is_phy10m_path(s) ? s->phy_reg[reg]
                         : (uint16_t)(s->phy_reg[reg] | (1u << 9));
        break;
    default:
        val = (reg < 32) ? s->phy_reg[reg] : 0u;
        break;
    }
    /* PHY read debug removed */
    return val;
}

