lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
static void ch32_eth_mdio_run(Ch32EthState *s, uint32_t *pmiiar, uint32_t *pmiidr)
{
    unsigned pa = (*pmiiar >> 11) & 0x1fu;
    unsigned ra = (*pmiiar >> 6) & 0x1fu;
    bool is_write = (*pmiiar & CH32_ETH_MACMIIAR_MW) != 0;

    if (pa != 1u) {
        if (is_write) {
            /* 忽略非 CH182 地址的写 */
        } else {
            *pmiidr = 0xffffu;
        }
        *pmiiar &= ~CH32_ETH_MACMIIAR_MB;
        return;
    }
    if (is_write) {
        ch32_eth_phy_write(s, ra, (uint16_t)(*pmiidr & 0xffffu));
    } else {
        *pmiidr = ch32_eth_phy_read(s, ra);
    }
    *pmiiar &= ~CH32_ETH_MACMIIAR_MB;
}

/*
 * ch32_eth_tx_coe - 模拟 TX 硬件校验和卸载引擎（COE）。
 *
 * CH32V30x ETH 的 TDes0[23:22] CIC 字段指示 MAC DMA 应自动补充哪些校验和：
 *
 *   CH32_ETH_DMATX_CIC_OFF (00): 不补充（固件自行填充或不需要）
 *   CH32_ETH_DMATX_CIC_IP  (01): 仅补 IPv4 头部校验和
 *   CH32_ETH_DMATX_CIC_SEG (10): IPv4 头部 + TCP/UDP 负载（segment only，不含伪头）
 *   CH32_ETH_DMATX_CIC_ALL (11): 全部（IPv4头部 + TCP/UDP/ICMP + 伪头）
 *
 * 对于 CIC_OFF 以外的所有模式，我们只需对实际为 0 的校验和字段进行软件补全。
 * 使用 net_checksum_calculate 处理 IPv4/TCP/UDP，并针对 ICMP 字段单独补全。
 */
static void ch32_eth_tx_coe(uint8_t *pkt, size_t len, uint32_t td0)
{
    uint32_t cic = td0 & CH32_ETH_DMATX_CIC_M;
    struct ip_header *iph;
    int iph_len;
    uint8_t *l4hdr;
    int l4_len;

    if (cic == CH32_ETH_DMATX_CIC_OFF) {
        /* COE 未启用，固件自行填充校验和 */
        return;
    }

    /* 包长至少需要能容纳一个局部头 + IP 头 + L4 头最小 8 字节 */
    if (len < sizeof(struct eth_header) + sizeof(struct ip_header) + 8u) {
        return;
    }

    iph = (struct ip_header *)(pkt + sizeof(struct eth_header));
    if (IP_HEADER_VERSION(iph) != IP_HEADER_VERSION_4) {
        /* 非 IPv4（如 IPv6 或非-IP），跳过 */
        return;
    }
    iph_len = IP_HDR_GET_LEN(iph);
    if (iph_len < (int)sizeof(struct ip_header) ||
        (size_t)((int)sizeof(struct eth_header) + iph_len) > len) {
        return;
    }

    /*
     * CIC_IP 及以上：补 IPv4 头部校验和。
     * net_checksum_calculate(CSUM_IP) 会处理 ip_sum 字段。
     */
    if (cic >= CH32_ETH_DMATX_CIC_IP) {
        net_checksum_calculate(pkt, (int)len, CSUM_IP);
    }

    /* CIC_SEG 和 CIC_ALL：补 TCP/UDP/ICMP 校验和 */
    if (cic >= CH32_ETH_DMATX_CIC_SEG) {
        l4hdr = (uint8_t *)iph + iph_len;
        l4_len = (int)lduw_be_p(&iph->ip_len) - iph_len;

        if (l4_len < 8) {
            return;
        }
        if ((size_t)((int)sizeof(struct eth_header) + iph_len + l4_len) > len) {
            return;
        }

        switch (iph->ip_p) {
        case IPPROTO_TCP:
        case IPPROTO_UDP:
            /*
             * CIC_SEG 和 CIC_ALL 对 TCP/UDP 效果一致：
             * net_checksum_calculate(CSUM_TCP/CSUM_UDP) 含 pseudo-header 计算。
             */
            net_checksum_calculate(pkt, (int)len,
                                   iph->ip_p == IPPROTO_TCP ? CSUM_TCP : CSUM_UDP);
            break;
        case IPPROTO_ICMP:
            /*
             * ICMP 校验和：只有 CIC_ALL 才要求硬件补全（CIC_SEG 不要求 ICMP）。
             * net_checksum_calculate 不处理 ICMP，这里手动补全。
             */
            if (cic == CH32_ETH_DMATX_CIC_ALL) {
                uint32_t csum;

                stw_he_p(l4hdr + 2, 0);     /* clear ICMP checksum field */
                csum = net_checksum_add(l4_len, l4hdr);
                stw_be_p(l4hdr + 2, net_checksum_finish(csum));
            }
            break;
        default:
            break;
        }
    }
}

static void ch32_eth_desc_read(hwaddr da, uint32_t *st, uint32_t *cb,
                              uint32_t *b1, uint32_t *b2)
{
    uint8_t buf[16];

    if (address_space_read(&address_space_memory, da,
                           MEMTXATTRS_UNSPECIFIED, buf, 16) != MEMTX_OK) {
        *st = *cb = *b1 = *b2 = 0;
        return;
    }
    *st = ldl_le_p(buf);
    *cb = ldl_le_p(buf + 4);
    *b1 = ldl_le_p(buf + 8);
    *b2 = ldl_le_p(buf + 12);
}

static void ch32_eth_desc_write_status(hwaddr da, uint32_t st)
{
    uint8_t b[4];

    stl_le_p(b, st);
    address_space_write(&address_space_memory, da, MEMTXATTRS_UNSPECIFIED,
                        b, 4);
}

static void ch32_eth_process_tx(Ch32EthState *s)
{
    NetClientState *nc;
    hwaddr base;
    int i;

    if ((s->mmio_w[CH32_ETH_OFF_DMAOMR / 4] & CH32_ETH_DMAOMR_ST) == 0) {
        return;
    }
    if (!s->nic) {
        return;
    }
    nc = qemu_get_queue(s->nic);
    if (!nc || !nc->peer) {
        return;
    }
    base = (hwaddr)s->mmio_w[CH32_ETH_OFF_DMATDLAR / 4];
    if (!ch32_eth_ptr_in_main_sram(base)) {
        return;
    }
    /* 初始化 chain 游标 */
    if (s->tx_cur_desc == 0) {
        s->tx_cur_desc = base;
    }

    for (i = 0; i < CH32_ETH_MAX_RING; i++) {
        hwaddr da = s->tx_cur_desc;
        uint32_t td0, td1, td2, td3;
        uint32_t len;
        uint8_t pkt[CH32_ETH_PKT_MAX];

        if (!ch32_eth_ptr_in_main_sram(da)) {
            s->tx_cur_desc = base;
            break;
        }
        ch32_eth_desc_read(da, &td0, &td1, &td2, &td3);
        if ((td0 & CH32_ETH_DMATX_OWN) == 0) {
            /* 无待发描述符 */
            break;
        }
        len = td1 & 0x1fffu;
        if (len == 0 || len > CH32_ETH_PKT_MAX) {
            /* 描述符长度异常，跳过并前进 */
            td0 &= ~CH32_ETH_DMATX_OWN;
            ch32_eth_desc_write_status(da, td0);
            s->tx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)td3) ?
                             (hwaddr)td3 : base;
            continue;
        }
        if (!ch32_eth_span_in_main_sram((hwaddr)td2, len)) {
            td0 &= ~CH32_ETH_DMATX_OWN;
            ch32_eth_desc_write_status(da, td0);
            ch32_eth_dmasr_raise(s, CH32_ETH_DMASR_TBUS);
            s->tx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)td3) ?
                             (hwaddr)td3 : base;
            break;
        }
        if (address_space_read(&address_space_memory, (hwaddr)td2,
                               MEMTXATTRS_UNSPECIFIED, pkt, len) != MEMTX_OK) {
            td0 &= ~CH32_ETH_DMATX_OWN;
            ch32_eth_desc_write_status(da, td0);
            s->tx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)td3) ?
                             (hwaddr)td3 : base;
            break;
        }
        /*
         * TX 硬件校验和卸载（Checksum Offload Engine）仿真：
         * TDes0 的 CIC [23:22] 字段指示硬件需要补充哪些校验和；
         * QEMU 这里进行软件模拟，确保发射的包校验和正确。
         */
        ch32_eth_tx_coe(pkt, len, td0);
        qemu_send_packet(nc, pkt, (int)len);
        /* 只清 OWN 位，保留固件写入的 FS/LS 等标志 */
        td0 &= ~CH32_ETH_DMATX_OWN;
        ch32_eth_desc_write_status(da, td0);
        /* 只设底层事件位，不设 NIS/AIS 汇总位（它们在 dmasr_read 中动态计算） */
        ch32_eth_dmasr_raise(s, CH32_ETH_DMA_IT_T);
        /* 通过 Buffer2NextDescAddr（td3）前进 chain 游标 */
        s->tx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)td3) ?
                         (hwaddr)td3 : base;
        /* 不 break：继续处理下一个待发描述符，直到环中无 OWN=1 */
    }
}

static void ch32_eth_rx_resume(Ch32EthState *s);

