lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
static void ch32_eth_deliver_rx_stash(Ch32EthState *s)
{
    hwaddr base;
    int i;

    if (s->rx_stash_len == 0) {
        return;
    }
    if ((s->mmio_w[CH32_ETH_OFF_DMAOMR / 4] & CH32_ETH_DMAOMR_SR) == 0) {
        /* SR=0 时不应有 stash；强制清零并恢复 tap，防止永久卡死 */
        s->rx_stash_len = 0;
        ch32_eth_rx_resume(s);
        return;
    }
    base = (hwaddr)s->mmio_w[CH32_ETH_OFF_DMARDLAR / 4];
    if (!ch32_eth_ptr_in_main_sram(base)) {
        /* DMARDLAR 无效；强制清零并恢复 tap，防止永久卡死 */
        s->rx_stash_len = 0;
        ch32_eth_rx_resume(s);
        return;
    }
    /* 初始化 chain 游标 */
    if (s->rx_cur_desc == 0) {
        s->rx_cur_desc = base;
    }

    for (i = 0; i < CH32_ETH_MAX_RING; i++) {
        hwaddr da = s->rx_cur_desc;
        uint32_t rd0, rd1, rd2, rd3;
        uint32_t fl;
        uint32_t new0;

        if (!ch32_eth_ptr_in_main_sram(da)) {
            s->rx_cur_desc = base;
            break;
        }
        ch32_eth_desc_read(da, &rd0, &rd1, &rd2, &rd3);
        if ((rd0 & CH32_ETH_DMARX_OWN) == 0) {
            /*
             * 当前描述符已被固件消费（OWN=0），前进到下一个描述符继续查找。
             * 若 Buffer2NextDescAddr 无效则回绕到链表头部。
             */
            s->rx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)rd3) ?
                             (hwaddr)rd3 : base;
            continue;
        }
        if (!ch32_eth_span_in_main_sram((hwaddr)rd2, s->rx_stash_len)) {
            /*
             * 描述符 buf 指针无效（rd2 超出 SRAM），丢弃此帧并前进游标。
             * 不清 rx_stash_len，让 poll 重试下一个描述符；若全部无效才丢包。
             */
            s->rx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)rd3) ?
                             (hwaddr)rd3 : base;
            ch32_eth_dmasr_raise(s, CH32_ETH_DMASR_RBUS);
            s->rx_stash_len = 0;   /* buf 无效，此帧无法投递，丢弃 */
            return;
        }
        if (address_space_write(&address_space_memory, (hwaddr)rd2,
                                MEMTXATTRS_UNSPECIFIED,
                                s->rx_stash, s->rx_stash_len) != MEMTX_OK) {
            ch32_eth_dmasr_raise(s, CH32_ETH_DMASR_RBUS);
            s->rx_stash_len = 0;
            ch32_eth_rx_resume(s);
            return;
        }
        fl = ((uint32_t)s->rx_stash_len + 4u) << 16;
        new0 = fl | CH32_ETH_DMARX_FS | CH32_ETH_DMARX_LS | CH32_ETH_DMARX_FT;
        new0 &= ~CH32_ETH_DMARX_OWN;
        /*
         * RX 硬件校验和卸载（IPC = MACCR bit10）仿真：
         * 当 MACCR.IPC=1 时，MAC 硬件会验证接收到的包的 IP/负载校验和。
         * QEMU 收到的包来自宿主机内核 TCP/IP 栈，校验和必然正确；
         * 因此在 RDes0 中不设 IPHCE（bit7）和 PCE（bit0）错误位。
         * 此外也不设 ES（错误汇总），确保固件不会因校验和错误而丢弃正常包。
         */
        ch32_eth_desc_write_status(da, new0);
        ch32_eth_dmasr_raise(s, CH32_ETH_DMA_IT_R);
        /* 通过 Buffer2NextDescAddr（rd3）前进 chain 游标 */
        s->rx_cur_desc = ch32_eth_ptr_in_main_sram((hwaddr)rd3) ?
                         (hwaddr)rd3 : base;
        s->rx_stash_len = 0;
        return;
    }
    /* 遍历完整个环形链表均无 OWN=1 描述符 */
    ch32_eth_dmasr_raise(s, CH32_ETH_DMASR_RBUS);
    /*
     * 描述符耗尽时丢弃 stash 中的帧，防止 tap 永久暂停。
     *
     * 当所有 RX 描述符都被 Guest 消费（OWN=0）且未归还时，stash 中的帧
     * 无法投递。如果不丢弃：rx_stash_len!=0 → can_receive=false →
     * tap_read_poll(false) → QEMU 不再从 tap 读取新包 → 网络永久卡死。
     *
     * 丢弃帧后 rx_stash_len=0，can_receive 恢复 true，tap 继续读取新包。
     * 如果 Guest 在 RBUS 中断处理中归还了描述符（设 OWN=1 写 DMARPDR），
     * 后续的 BH 或 poll timer 会正确投递新帧。
     *
     * 代价：高速流量下偶尔丢帧，但远好过网络永久卡死。
     */
    s->rx_stash_len = 0;
    ch32_eth_rx_resume(s);
}

/*
 * ch32_eth_rx_resume - flush 排队包并恢复 tap 读取轮询。
 *
 * qemu_flush_or_purge_queued_packets 只清 receive_disabled，不恢复
 * tap_read_poll 状态（tap fd 被 set_fd_handler 到 NULL）。
 * 当队列恰好为空时 flush 返回 true 但没有触发 tap_send_completed 回调，
 * tap 的 read_poll 仍为 false，导致 WDT 复位后 tap fd 永不触发新包。
 * 修复：在 flush 之后，若 peer 提供了 poll 接口，显式调用 poll(true)
 * 重新向事件循环注册 tap fd 读取处理函数。
 */
static void ch32_eth_rx_resume(Ch32EthState *s)
{
    NetClientState *nc = qemu_get_queue(s->nic);

    qemu_flush_or_purge_queued_packets(nc, false);
    /*
     * 直接恢复 peer（tap）的读取轮询：
     * tap_poll(enable=true) → tap_read_poll(true) → qemu_set_fd_handler(tap_send)
     */
    if (nc->peer && nc->peer->info->poll) {
        nc->peer->info->poll(nc->peer, true);
    }
}

/*
 * ETH poll timer 间隔（虚拟时钟 ns）：
 *   CH32_ETH_POLL_FAST：有活跃 TX/RX 工作时使用，10 ms。
 *   CH32_ETH_POLL_SLOW：连续若干次 BH 无实际工作后切换，100 ms。
 *   CH32_ETH_POLL_IDLE_THR：连续无工作 BH 次数阈值，超过后切慢速。
 *
 * 典型场景：固件建立 TCP 连接后 HTTP 静默期无流量，poll 退到慢速，
 * 宿主机 curl 请求到来时由 net_receive→BH 立即处理（不依赖 poll）。
 */
#define CH32_ETH_POLL_FAST_NS   (10ULL * 1000 * 1000)   /* 10 ms */
#define CH32_ETH_POLL_SLOW_NS   (100ULL * 1000 * 1000)  /* 100 ms */
#define CH32_ETH_POLL_IDLE_THR  4u

static void ch32_eth_bh(void *opaque)
{
    Ch32EthState *s = opaque;
    uint32_t stash_before;
    bool rx_had_work, tx_had_work;
    uint32_t dmasr_before;

    /*
     * TX: 扫描整个描述符环处理所有待发帧。
     * RX: 投递 stash 中的帧。
     */
    dmasr_before = s->mmio_w[CH32_ETH_OFF_DMASR / 4];
    ch32_eth_process_tx(s);
    tx_had_work = (s->mmio_w[CH32_ETH_OFF_DMASR / 4] & CH32_ETH_DMA_IT_T) &&
                  !(dmasr_before & CH32_ETH_DMA_IT_T);

    stash_before = s->rx_stash_len;
    ch32_eth_deliver_rx_stash(s);
    rx_had_work = (stash_before != 0 && s->rx_stash_len == 0);
    /*
     * 仅当 deliver 成功清空了 stash（stash_before!=0 && 现在=0）时才 resume；
     * 否则（deliver 失败，stash 仍非空）不调用，避免描述符未归还
     * 时就让后续包进来造成级联失败。等固件写 DMARPDR 后再次来的 BH 里再 resume。
     */
    if (rx_had_work) {
        ch32_eth_rx_resume(s);
    }
    /*
     * 退避计数：有实际 TX/RX 工作则清零（恢复快速轮询），否则累加。
     */
    if (tx_had_work || rx_had_work) {
        s->poll_idle_count = 0;
    } else {
        if (s->poll_idle_count < CH32_ETH_POLL_IDLE_THR + 1u) {
            s->poll_idle_count++;
        }
    }
    /*
     * BH 完成后重新同步中断：
     * 若 BH 期间设置了新的 DMASR 事件位（如 TX 完成或 RX 完成），
     * 但 Guest 正在处理上一次中断（irq_active=true），新事件不会
     * 在 dmasr_raise 中注入 MEIP。BH 结束后若 irq_active=false（Guest
     * 已 mret），需要重新检查是否应该注入 MEIP。
     *
     * 场景：Guest mret → MEIP 撤销 → 但 DMASR 仍有未处理的 R/T 位
     * 此时需要重新注入 MEIP，否则中断会丢失。
     */
    ch32_eth_update_irq(s);
}

static void ch32_eth_poll_tick(void *opaque)
{
    Ch32EthState *s = opaque;
    uint32_t omr = s->mmio_w[CH32_ETH_OFF_DMAOMR / 4];
    uint64_t interval_ns;

