lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
    /*
     * PHY PHYLINK 中断注入（仅 10M 内置 PHY）：
     * EVT eth_driver_10M.c 在 WCHNET_ETHIsr() 中检测 ETH_DMA_IT_PHYLINK
     * 位来调用 ETH_PHYLink()，而不是轮询 BSR。
     * 当 phy_link_up_deadline_ns 到期（BSR 开始返回 link-up）时，
     * 主动设置 DMASR PHYLINK 位并触发 ETH 中断，使固件完成 PHY link-up 配置。
     */
    if (ch32_eth_is_phy10m_path(s) && !s->phy_link_irq_injected &&
        qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) >= s->phy_link_up_deadline_ns) {
        s->phy_link_irq_injected = true;
        ch32_eth_dmasr_raise(s, CH32_ETH_DMA_IT_PHYLINK);
    }

    if ((omr & (CH32_ETH_DMAOMR_ST | CH32_ETH_DMAOMR_SR)) == 0) {
        /*
         * DMA 未启动：
         * 10M 模式下保持 poll timer 持续运行，处理以下场景：
         * 1. deadline 未到：等待到期后注入 PHYLINK 中断
         * 2. deadline 到期且已注入：等待 BCR 软复位（固件 ETH_PHYLink
         *    失败后会重置 deadline + phy_link_irq_injected=false）
         */
        if (ch32_eth_is_phy10m_path(s)) {
            timer_mod(&s->poll, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + CH32_ETH_POLL_FAST_NS);
            return;
        }
        s->poll_active = false;
        s->poll_idle_count = 0;
        return;
    }
    /*
     * 退避轮询：连续 CH32_ETH_POLL_IDLE_THR 次 BH 无实际工作后切换到慢速，
     * 降低 CPU 占用。有流量时（net_receive 触发 bh_schedule）不依赖此 timer。
     */
    interval_ns = (s->poll_idle_count >= CH32_ETH_POLL_IDLE_THR)
                  ? CH32_ETH_POLL_SLOW_NS : CH32_ETH_POLL_FAST_NS;
    qemu_bh_schedule(s->bh);
    timer_mod(&s->poll, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + interval_ns);
}

static void ch32_eth_poll_arm(Ch32EthState *s)
{
    if (s->poll_active) {
        return;
    }
    s->poll_active = true;
    s->poll_idle_count = 0;
    timer_mod(&s->poll, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + CH32_ETH_POLL_FAST_NS);
}

static ssize_t ch32_eth_net_receive(NetClientState *nc, const uint8_t *buf,
                                    size_t size)
{
    Ch32EthState *s = qemu_get_nic_opaque(nc);

    if (size == 0 || size > CH32_ETH_PKT_MAX) {
        return -1;
    }
    /*
     * 仅在 guest 已启动 DMA 接收且配置了描述符环时暂存帧；否则 NIC 仍会收到
     * 宿主机报文，会把数据写到未初始化的 rd2，冲掉 SRAM 中的内核对象。
     */
    if ((s->mmio_w[CH32_ETH_OFF_DMAOMR / 4] & CH32_ETH_DMAOMR_SR) == 0) {
        /*
         * DMA 接收未启动：丢弃包但返回 size（而非 0），
         * 避免 tap 进入 read_poll=false 暂停状态。
         */
        return (ssize_t)size;
    }
    if (s->mmio_w[CH32_ETH_OFF_DMARDLAR / 4] == 0) {
        return (ssize_t)size;
    }
    if (s->rx_stash_len != 0) {
        /*
         * stash 中已有一帧未投递（上次 deliver 找不到可用描述符），
         * 返回 0 通知 tap 暂停读取，等待下次 poll 重试投递后再收包。
         */
        return 0;
    }
    memcpy(s->rx_stash, buf, size);
    s->rx_stash_len = (uint32_t)size;
    qemu_bh_schedule(s->bh);
    return (ssize_t)size;
}

static bool ch32_eth_net_can_receive(NetClientState *nc)
{
    Ch32EthState *s = qemu_get_nic_opaque(nc);

    /*
     * 仅检查 stash 是否已有一帧待投递，不检查 DMAOMR_SR。
     * 原因：若 can_receive 返回 false， QEMU tap 后端会暂停读取
     * （tap_read_poll(false)），后续无法通过空队列 flush 来恢复，
     * 导致 WDT 复位后 tap 永久暂停。对 DMAOMR_SR=0 的情况在
     * receive() 内返回 size 并丢弃包即可（不占 stash）。
     */
    return s->rx_stash_len == 0;
}

static NetClientInfo ch32_eth_net_info = {
    .type = NET_CLIENT_DRIVER_NIC,
    .size = sizeof(NICState),
    .receive = ch32_eth_net_receive,
    .can_receive = ch32_eth_net_can_receive,
};

static uint32_t ch32_eth_dmasr_read(const Ch32EthState *s)
{
    uint32_t v = s->mmio_w[CH32_ETH_OFF_DMASR / 4];
    uint32_t omr = s->mmio_w[CH32_ETH_OFF_DMAOMR / 4];

    /*
     * 动态计算 NIS/AIS 汇总位：
     * NIS = Normal 中断源位（R, T 等）的 OR
     * AIS = Abnormal 中断源位（RBUS, TBUS, ER 等）的 OR
     * 这些位是只读的，固件 W1C 清它们无效——底层事件位清除后自动归零。
     */
    if (v & CH32_ETH_DMASR_NIS_SRC) {
        v |= CH32_ETH_DMA_IT_NIS;
    } else {
        v &= ~CH32_ETH_DMA_IT_NIS;
    }
    if (v & CH32_ETH_DMASR_AIS_SRC) {
        v |= CH32_ETH_DMA_IT_AIS;
    } else {
        v &= ~CH32_ETH_DMA_IT_AIS;
    }

    /*
     * DMASR 中 TPS(20:22)/RPS(17:19) 反映收发状态机；库与驱动会读此域。
     * 模型在 ST/SR 置位时给出「运行中」典型编码，其余为 Stopped。
     */
    v &= ~CH32_ETH_DMASR_TPS_M;
    if (omr & CH32_ETH_DMAOMR_ST) {
        v |= CH32_ETH_DMASR_TPS_FETCH;
    }
    v &= ~CH32_ETH_DMASR_RPS_M;
    if (omr & CH32_ETH_DMAOMR_SR) {
        v |= CH32_ETH_DMASR_RPS_WAIT;
    }
    return v;
}

static uint32_t ch32_eth_mmio_read_word(Ch32EthState *s, hwaddr addr)
{
    unsigned wi;

    if (addr >= CH32_ETH_MMIO_SIZE || (addr & 3)) {
        return 0;
    }
    wi = (unsigned)(addr / 4);
    if (addr == CH32_ETH_OFF_DMASR) {
        return ch32_eth_dmasr_read(s);
    }
    return s->mmio_w[wi];
}

static uint64_t ch32_eth_mmio_read(void *opaque, hwaddr addr, unsigned size)
{
    Ch32EthState *s = opaque;
    uint32_t w;

    if (addr + size > CH32_ETH_MMIO_SIZE || (addr & (size - 1))) {
        return 0;
    }
    w = ch32_eth_mmio_read_word(s, addr & ~3ull);
    if (size == 4) {
        return w;
    }
    if (size == 2) {
        return (w >> ((addr & 2) * 8)) & 0xffffu;
    }
    return (w >> ((addr & 3) * 8)) & 0xffu;
}

static void ch32_eth_mmio_write_word(Ch32EthState *s, hwaddr addr, uint32_t val)
{
    unsigned wi;

    if (addr >= CH32_ETH_MMIO_SIZE || (addr & 3)) {
        return;
    }
    wi = (unsigned)(addr / 4);

    if (addr == CH32_ETH_OFF_MACMIIAR) {
        s->mmio_w[wi] = val;
        if (val & CH32_ETH_MACMIIAR_MB) {
            ch32_eth_mdio_run(s, &s->mmio_w[wi], &s->mmio_w[CH32_ETH_OFF_MACMIIDR / 4]);
        }
        return;
    }
    if (addr == CH32_ETH_OFF_DMABMR) {
        if (val & CH32_ETH_DMABMR_SR) {
            /* 软件复位：立即清 SR，避免固件在 while(DMABMR&SR) 中阻塞 */
            val &= (uint32_t)~CH32_ETH_DMABMR_SR;
        }
        s->mmio_w[wi] = val;
        return;
    }
    if (addr == 0x100u) {
        /*
         * MMCCR（MAC MMC Control Register）：CR 位（bit0）写 1 启动计数器复位，
         * 硬件完成后自动清零。QEMU 立即清零，避免固件 while(ETH->MMCCR&CR) 死循环。
         */
        val &= ~0x00000001u;  /* 清 CR 位（counters reset 瞬间完成）*/
        s->mmio_w[wi] = val;
        return;
    }
    if (addr == CH32_ETH_OFF_DMASR) {
        s->mmio_w[wi] &= ~(val & CH32_ETH_DMASR_W1C_MASK);
        /* 固件清标志后重新同步中断电平 */
        ch32_eth_update_irq(s);
        return;
    }
    if (addr == CH32_ETH_OFF_DMATPDR || addr == CH32_ETH_OFF_DMARPDR) {
        s->mmio_w[wi] = val;
        qemu_bh_schedule(s->bh);
        return;
    }
    if (addr == CH32_ETH_OFF_DMAOMR) {
        /*
         * FTF：Flush TX FIFO，真机完成后清 0；模型立即清除，避免
         * ETH_FlushTransmitFIFO 后固件自旋等待。
         */
        val &= (uint32_t)~CH32_ETH_DMAOMR_FTF;
        s->mmio_w[wi] = val;
        if (val & (CH32_ETH_DMAOMR_ST | CH32_ETH_DMAOMR_SR)) {
            ch32_eth_poll_arm(s);
            /*
             * SR 刚被启动（固件初始化完成 RX DMA）：尝试恢复 tap 读取并投递所有已排队的包。
             * ch32_eth_rx_resume 在 flush 基础上额外调用 peer->poll(true)
             * 确保 tap fd 的 read_poll 被恢复，即使队列为空。
             */
            ch32_eth_rx_resume(s);
        } else {
            /*
             * DMA 停止（ST=SR=0）：
             * 10M 模式下 poll timer 用于检测 PHY PHYLINK deadline，
             * 不能因 DMA 未启动就删除——否则 ETH_Init 中途写 DMAOMR
             *（只设配置位，不含 ST/SR）会删掉等待注入的 poll timer。
             * 只有在非 10M 模式下才停止 poll。
             */
            if (!ch32_eth_is_phy10m_path(s)) {
                timer_del(&s->poll);
                s->poll_active = false;
            }
        }
        return;
    }
    s->mmio_w[wi] = val;
}

static void ch32_eth_mmio_write(void *opaque, hwaddr addr, uint64_t val64,
                                unsigned size)
{
    Ch32EthState *s = opaque;
    hwaddr waddr = addr & ~3ull;
    unsigned wi = (unsigned)(waddr / 4);
    uint32_t cur = s->mmio_w[wi];
    uint32_t val = (uint32_t)val64;

    if (addr + size > CH32_ETH_MMIO_SIZE || (addr & (size - 1))) {
        return;
    }
    if (size == 4) {
        ch32_eth_mmio_write_word(s, addr, val);
        return;
    }
    if (size == 2) {
        uint32_t m = 0xffffu << ((addr & 2) * 8);

        ch32_eth_mmio_write_word(s, waddr, (cur & ~m) | ((val & 0xffffu) << ((addr & 2) * 8)));
        return;
    }
    {
        uint32_t m = 0xffu << ((addr & 3) * 8);

        ch32_eth_mmio_write_word(s, waddr, (cur & ~m) | ((val & 0xffu) << ((addr & 3) * 8)));
    }
}

static const MemoryRegionOps ch32_eth_mmio_ops = {
    .read = ch32_eth_mmio_read,
    .write = ch32_eth_mmio_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
    },
};

