lintel/qemu-ch32v/qemu-overlay/10.2.2/hw/riscv/ch32-eth-dwmac.c
/*
 * IWDG 等触发 qemu_system_reset_request 时，若不清空 DMA 影子寄存器与 poll/BH，
 * 复位后固件尚未重建描述符环，模型仍可能按旧 DMARDLAR/DMATDLAR 写 SRAM，
 * 破坏堆栈并表现为 ETH 打印中途反复「OrayOS-Tiny Starting...」。
 */
static void ch32_eth_reset(DeviceState *dev)
{
    Ch32EthState *s = CH32_ETH_DWMAC(dev);

    timer_del(&s->poll);
    s->poll_active = false;
    if (s->bh) {
        qemu_bh_cancel(s->bh);
    }
    memset(s->mmio_w, 0, sizeof(s->mmio_w));
    memset(s->phy_reg, 0, sizeof(s->phy_reg));
    /* PHY BCR 上电默认值：PHY10M=0x1000、RTL8211F=0x1140、CH182=0x3100 */
    s->phy_bcr = ch32_eth_phy_bcr_reset(s);
    s->phy_bsr = 0x7809u; /* link-down 初始值 */
    s->rx_stash_len = 0;
    s->irq_active = false;
    /*
     * PHY link-up 延迟：500ms 后认为链路建立。
     * 这使得 ETH_Configuration() 初始化时读到 link-down，
     * 而后续的 WCHNET_QueryPhySta() 读到 link-up 触发 ETH_PHYLink()。
     */
    s->phy_link_up_deadline_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 500 * 1000000ULL;
    s->phy_link_irq_injected = false;
    /* 复位时清理 RTL8211F 扩展寄存器状态 */
    s->rtl8211f_page = 0x0000u;
    s->rtl8211f_mmd_ctrl = 0x0000u;
    s->rtl8211f_mmd_addr = 0x0000u;
    /* 复位时清零 chain 游标，下次 DMA 启动时重新从 DMATDLAR/DMARDLAR 初始化 */
    s->tx_cur_desc = 0;
    s->rx_cur_desc = 0;
    /* 复位后恢复 tap 读取轮询，确保 WDT 复位后 NIC 能立即接收新包 */
    if (s->nic) {
        ch32_eth_rx_resume(s);
    }
    /* 10M 模式：复位后重新启动 poll timer，以便检测新的 PHYLINK deadline */
    if (ch32_eth_is_phy10m_path(s)) {
        s->poll_active = true;
        timer_mod(&s->poll, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + CH32_ETH_POLL_FAST_NS);
    }
    /* 复位时撤销 ETH 中断 */
    ch32_eth_meip_resync(s->machine);
}

static void ch32_eth_realize(DeviceState *dev, Error **errp)
{
    Ch32EthState *s = CH32_ETH_DWMAC(dev);

    memory_region_init_io(&s->mmio, OBJECT(dev), &ch32_eth_mmio_ops, s,
                          "ch32-eth-dwmac-mmio", CH32_ETH_MMIO_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->mmio);
    qemu_macaddr_default_if_unset(&s->conf.macaddr);

    s->nic = qemu_new_nic(&ch32_eth_net_info, &s->conf,
                          object_get_typename(OBJECT(dev)), dev->id,
                          &dev->mem_reentrancy_guard, s);
    qemu_format_nic_info_str(qemu_get_queue(s->nic), s->conf.macaddr.a);

    s->bh = qemu_bh_new(ch32_eth_bh, s);
    timer_init_ns(&s->poll, QEMU_CLOCK_VIRTUAL, ch32_eth_poll_tick, s);

    /*
     * 解析 phy-model 字符串属性，填充 phy_variant。
     * 规则：phy-model 非空时按 "rtl8211f|phy10m|ch182" 匹配，未知值拒绝
     * realize；为空时默认 CH182（与 V317 旧行为一致）。
     */
    if (s->phy_model != NULL) {
        if (!strcmp(s->phy_model, "rtl8211f")) {
            s->phy_variant = CH32_ETH_PHY_RTL8211F;
        } else if (!strcmp(s->phy_model, "phy10m")) {
            s->phy_variant = CH32_ETH_PHY_PHY10M;
        } else if (!strcmp(s->phy_model, "ch182")) {
            s->phy_variant = CH32_ETH_PHY_CH182;
        } else {
            error_setg(errp,
                       "ch32-eth-dwmac: unknown phy-model '%s'"
                       " (expected ch182|phy10m|rtl8211f)",
                       s->phy_model);
            return;
        }
    } else {
        s->phy_variant = CH32_ETH_PHY_CH182;
    }

    s->phy_bsr = 0x7809u;
    /* phy_bcr 复位值依据 phy_variant 决定（PHY10M=0x1000、RTL8211F=0x1140、CH182=0x3100）*/
    s->phy_bcr = ch32_eth_phy_bcr_reset(s);
    s->phy_link_up_deadline_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 500 * 1000000ULL;
    /*
     * 10M 模式：realize 时立即启动 poll timer，以便在
     * DMA 启动前就能检测 PHY link-up deadline 并注入 PHYLINK 中断。
     * EVT 固件的 PHY 初始化在 ETH_LibInit 中，它启动 DMA。
     */
    if (ch32_eth_is_phy10m_path(s)) {
        s->poll_active = true;
        timer_mod(&s->poll, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + CH32_ETH_POLL_FAST_NS);
    }
}

static void ch32_eth_finalize(Object *obj)
{
    Ch32EthState *s = CH32_ETH_DWMAC(obj);

    timer_del(&s->poll);
    if (s->bh) {
        qemu_bh_delete(s->bh);
        s->bh = NULL;
    }
    if (s->nic) {
        qemu_del_nic(s->nic);
        s->nic = NULL;
    }
}

static const Property ch32_eth_properties[] = {
    DEFINE_NIC_PROPERTIES(Ch32EthState, conf),
    DEFINE_PROP_STRING("phy-model", Ch32EthState, phy_model),
};

static void ch32_eth_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = ch32_eth_realize;
    device_class_set_legacy_reset(dc, ch32_eth_reset);
    device_class_set_props(dc, ch32_eth_properties);
    set_bit(DEVICE_CATEGORY_NETWORK, dc->categories);
}

static const TypeInfo ch32_eth_type_info = {
    .name = TYPE_CH32_ETH_DWMAC,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Ch32EthState),
    .instance_finalize = ch32_eth_finalize,
    .class_init = ch32_eth_class_init,
};

static void ch32_eth_register_types(void)
{
    type_register_static(&ch32_eth_type_info);
}

type_init(ch32_eth_register_types)

/*
 * ch32_eth_set_machine - 设置 ETH 外设与 machine 的双向关联。
 * 由 ch32-v.c 在 machine init 中调用，使 ch32_eth_meip_resync 能访问 PFIC/CPU。
 */
void ch32_eth_set_machine(DeviceState *eth_dev, Ch32MachineState *m)
{
    Ch32EthState *s = CH32_ETH_DWMAC(eth_dev);

    s->machine = m;
    m->eth_state = s;
}
